{
  "year": "2017",
  "caption": "Samsung Galaxy S8 X Boiler Room Present Infinity Sounds",
  "description": "We produced the visual experience to complement this major music event and to conceptualise the Samsung Galaxy S8 Infinity display. Our vision was to create four unique and immersive CG environments with infinite horizons and scale, from micro to macro. These environments were constructed through generative visuals; never ending, infinite, computed on the fly, responsive to the music and always different.\n\nThis is the first outcome from our research into art directed generative content that can exist across multiple platforms, from large scale LED walls through to smartphones and the web. \n\nWe created a minimal CG look with a reductive colour palette, swapping fine details for bold elements which would read well in the live warehouse setting.",
  "client": "Samsung Australia / Boiler Room",
  "direction": "Nic Hamilton / Dave Mackenzie",
  "production": "",
  "design": "Su-yiin Lai",
  "sound": "",
  "development": "Callum Neideck",
  "tag": "GENERATIVE",
  "focus": "Having the power or function of generating, originating, producing, or reproducing. Art directed content produced on the fly. ",
  "body": "Our system was operated live on the night. It comprised real-time-ready art directed assets and custom software for audio processing and reaction. Directly hooked into the booth we received a line for audio which was then run through our software to detect Kick, Hi-Hats, Snares while also measuring and evaluating overall energy of the music. Real-time analysis of processed audio then guided the on screen graphics. Output over standard HDMI, our graphics were mapped to eight large format LED displays.",
  "hero3":"https://video.unsignedstudio.io/samsungxboilerroom/samsung_reel.mp4",
  "hero3_caption": "A quick look behind the scenes.",
  "hero3_controls": true,
  "hero4_caption": "A large array of large format LED panels served as the canvas for our visuals. Arranged uniquely, forcing the perspective to further reinforce the concept of infinity. ",
  "hero5_caption": "Each of the environments in their different states.",
  "med1_caption": "CONCEPT: Urban Mist - Following a minimal ship gliding through a cityscape. Visuals matched to Flight Facilities.",
  "med2_caption": "CONCEPT: Endless Desert - Following a classic car through an endless desert. Visuals matched to Jacques Renault.",
  "med3_caption": "CONCEPT: Jungle Run - We follow a glowing orb along an endless path. Visuals matched to KLLO.",
  "med4_caption": "CONCEPT: Subterranean - Following an UUV through a never ending cave system. Visuals matched to Adi Toohey.",
  "four_column": true
}
 


   

